Revit 2015 API
FamilySymbol.HasStructuralSection Method
 Identifies if this FamilySymbol can have a structural section.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
Since: 2015
Syntax
C#
public bool HasStructuralSection()
Visual Basic
Public Function HasStructuralSection As Boolean
Visual C++
public:
bool HasStructuralSection()
Return Value
 True if the FamilySymbol can have structural section, false otherwise.
See Also
FamilySymbol Class
Autodesk.Revit.DB Namespace